# Introduction to Databases and SQL #
## Databases ##
**Databases** are a collection of data that is stored in a computer system. Databases allow us to store, retrieve, and manipulate data. Databases are used in many applications, such as websites, mobile apps, and desktop applications. Databases use tables to store data. Each table has columns and rows. Columns represent the *attributes* of the data, and rows represent *individual records*.

## SQL ##
**SQL (Structured Query Language)** is a programming language used to interact with databases. SQL allows us to create, read, update, and delete data in a database. SQL is used to perform operations on databases, such as querying data, inserting data, updating data, and deleting data.

**The basic SQL commands are:**
- `SELECT`: Used to retrieve data from a database.
- `INSERT`: Used to insert data into a database.
- `UPDATE`: Used to update data in a database.



## Part 1 - Creating a table ##
**In the code below we will:** 
1. Connect to a new database (school.db) using duckdb.
2. Create a table called 'test' with one column: "num" which stores an integer. *Integers are whole numbers (ie. positive or negative but not a decimal)*
3. Insert some data into this table 
4. Query the table to see what we have inserted. 
5. Update the data in the table and query again to see the changes.
6. Close the connection to the database.

> Note: to allow some code to only be run once, while other code runs multiple times, we have separated them into separate cells. To run the code, click on the play button for each cell in order.

In [2]:
# You just have to run this cell once to load the database. It's Python code, but the rest will run as SQL.
import duckdb

In [3]:
%load_ext sql
# This cell sets up the connection to the database. You definitely need to run this (exactly once) before running any other cells.
conn = duckdb.connect(database='school.ddb', read_only=False)
%sql conn --alias duckdb
%config SqlMagic.autopandas = True
%config SqlMagic.feedback = False
%config SqlMagic.displaycon = False
# This last line seems to be needed for Mac. Maybe windows too - who knows?
%config SqlMagic.style = "_DEPRECATED_MARKDOWN"

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [4]:
%%sql
CREATE OR REPLACE TABLE test (num INTEGER);

Empty DataFrame
Columns: [Count]
Index: []

In [5]:
%%sql

-- This code will add a new row to the table each time you run it. You can run it as many times as you want.
-- Change the number to add a different value to see this in action. 
INSERT INTO test VALUES (42);
CHECKPOINT;

SELECT * FROM test

   num
0   42

In [6]:
%%sql
-- Change the value of a row in the table.
UPDATE test SET num = 17 WHERE num = 42;

CHECKPOINT;
SELECT * FROM test;

   num
0   17

## Additional SQL Commands ##
In addition to `SELECT`, `INSERT`, and `UPDATE`, there are other SQL commands that can be used to interact with databases. We already saw how to create a table, but there are also commands to delete a table (`DROP TABLE`), delete data from a table (`DELETE FROM`), and alter a table (`ALTER TABLE`). These commands can be used to modify the structure of a database, add or remove data, and perform other operations.

## Part 2 - Modifying and deleting from tables ##
**In the code below we will:**
1. Reconnect to the database (school.db) using a self-closing context managers.
2. Alter the table 'test' by adding a new column called "name" which stores text data as `VARCHAR`. Set the default value of this column to "Boris".
3. Insert some new data into this table and query
4. Delete some of the data from the table and query again to see the changes.
5. Drop the table 'test' and close the connection to the database.

In [7]:
%%sql
-- Adding a new column to the table. NOTE: This will error if the column already exists (so only run it once)
ALTER TABLE test ADD COLUMN name VARCHAR DEFAULT 'Boris';

SELECT * FROM test;

   num   name
0   17  Boris

In [8]:
%%sql
-- 4. Add a row to the table. Feel free to use your own values.
INSERT INTO test VALUES (42, 'Alice');

SELECT * FROM test;

   num   name
0   17  Boris
1   42  Alice

In [9]:
%%sql
DELETE FROM test WHERE name = 'Boris';

SELECT * FROM test;

   num   name
0   42  Alice

In [10]:
%%sql
DROP TABLE test;

Empty DataFrame
Columns: [Success]
Index: []

## Part 3 - Writing your own SQL ##
Now that we have cleared out our table, we can start to apply our knowledge of SQL to a real-world problem. In the code below we will:

1. Create a new table called 'students' with the following columns:
    - `student_id` (integer) - primary key
    - `first_name` (text) - the first name of the student
    - `last_name` (text) - the last name of the student
    - `age` (integer) - the age of the student
    - `year_level` (integer) - the grade of the student
2. Insert some data into this table
    - Create at least one row using a favourite fictional character
    - the `student_id` field should be unique. Later in this notebook, we will learn how to automatically generate unique ids. For now just start at 1 and go up 1 from there.
3. Query the table to see what we have inserted

Fill in the blanks in the code below to complete the tasks. Each task has its own cell to allow you to run and debug each operation separately

In [ ]:
%%sql
-- 1. Creating a new table called 'students' with five columns: student_id, first_name, last_name, age, and year_level.
-- Uncomment the code and complete it to create the table.

CREATE OTABLE students (student_id INTEGER PRIMARY KEY, first_name VARCHAR, last_name VARCHAR, age INTEGER, year_level INTEGER);


SELECT * FROM students;

Empty DataFrame
Columns: [student_id, first_name, last_name, age, year_level]
Index: []

In [12]:
%%sql

-- 2. Adding rows to the table. Add as many as you like (at least 5), just be sure to change the values and increment the id. 
-- Be sure to include different ages and year levels. The id must be unique for each row.

INSERT INTO students VALUES (1, 'Roger', 'Rabbit', 18, 11);
INSERT INTO students VALUES (2, 'Mickey', 'Mouse', 17, 10);
INSERT INTO students VALUES (3, 'Donald', 'Duck', 16, 9);
INSERT INTO students VALUES (4, 'Goofy', 'Goof', 15, 8);
INSERT INTO students VALUES (5, 'Daisy', 'Duck', 14, 7);
INSERT INTO students VALUES(6, 'Donald', 'Rumsfeld', 18, 11);
INSERT INTO students VALUES(7, 'George', 'Bush', 17, 10);
INSERT INTO students VALUES(8, 'Bill', 'Clinton', 16, 9);
INSERT INTO students VALUES(9, 'George', 'Washington', 15, 8);
INSERT INTO students VALUES(10, 'Abraham', 'Lincoln', 14, 7);
INSERT INTO students VALUES(11, 'Penelope', 'Pitstop', 18, 11);
INSERT INTO students VALUES(12, 'Lisa', 'Simpson', 17, 12);

CHECKPOINT;

SELECT * FROM students;

    student_id first_name   last_name  age  year_level
0            1      Roger      Rabbit   18          11
1            2     Mickey       Mouse   17          10
2            3     Donald        Duck   16           9
3            4      Goofy        Goof   15           8
4            5      Daisy        Duck   14           7
5            6     Donald    Rumsfeld   18          11
6            7     George        Bush   17          10
7            8       Bill     Clinton   16           9
8            9     George  Washington   15           8
9           10    Abraham     Lincoln   14           7
10          11   Penelope     Pitstop   18          11
11          12       Lisa     Simpson   17          12

In [13]:
%%sql
-- 3. Querying the Database. To get all the values from a table, we just used con.table('table_name').show(). Now we want to write
-- custom SQL queries to get specific data. 
--  This first query will get the first name and age of all the students who are older than 15. 
-- Use the formatting of the first query to write the second query, 
-- which will get all the students who have a year level of 12.
 
SELECT first_name, age 
    FROM students 
    WHERE age > 15;

  first_name  age
0      Roger   18
1     Mickey   17
2     Donald   16
3     Donald   18
4     George   17
5       Bill   16
6   Penelope   18
7       Lisa   17

In [14]:
%%sql

-- Write your own query to get the first name and last name of all students in year 12.

SELECT first_name, last_name
    FROM students
    WHERE year_level = 12;

  first_name last_name
0       Lisa   Simpson

## Part 4 - Creating a sequence ##
At the moment we have to manually enter the `student_id` field for each row. This is not ideal as it is easy to make a mistake and enter the same student_id twice. To avoid this, we can create a sequence that will automatically generate unique ids for us.

A sequence is a database object that generates a sequence of numbers. This ensures that our ids will always be unique when we use the sequence to generate them.

**In the code below we will:**
1. Create a sequence called 'student_id_seq' that starts at 100 (to keep it safe) and increments by 1.
2. Alter the 'students' table to set the default value of the `student_id` column to the next value in the sequence.
3. Insert some new data into the 'students' table and query to see the changes.

In [ ]:
%%sql

-- 1. Creating a sequence. This will be used to generate unique student IDs.
--  NOTE: as with any CREATE or ALTER statement, we only want to run it once. 
CREATE OR REPLACE sequence student_id_seq START 100;

--  2. Altering the students table 
ALTER TABLE students ALTER COLUMN student_id SET DEFAULT nextval('student_id_seq');

CHECKPOINT;

Empty DataFrame
Columns: [Success]
Index: []

In [19]:
%%sql
-- 3. Adding a new student to the table. This time we don't need to specify the ID, as it will be generated automatically.
-- Make sure you have at least one pair of students with the same first name, but different last names.
INSERT INTO students (first_name, last_name, age, year_level) VALUES ('Kamala', 'Harris', 14, 10);

   Count
0      1

## Part 5 - Complex SQL Conditions ##

In addition to simple conditions, SQL allows us to use complex conditions to filter data. We can use `AND`, `OR`, and `NOT` to combine conditions and create more complex queries. We can also use comparison operators such as `=`, `!=`, `<`, `>`, `<=`, and `>=` to compare values. These operators can be used to filter data based on specific criteria.

**In the code below, you should:**
1. Query the `students` table to find all students who are in year 10 **and** are 15 years old.
2. Query the `students` table to find all students who are in year 12 **or** are 18 years old.
3. Query the `students` table to find all students who are **not** in year 9.
4. Query the `students` table to find all students who are **not** in year 9 **and** are **not** 13 years old.
5. Query the `students` table to find all students who are **not** in year 9 **or** are **not** 13 years old.

You might want to add additional rows to the `students` table to ensure you have enough data to test these queries thoroughtly.

In [20]:
%%sql

-- It's up to you now! 
-- 1. All students who are in year 10 AND are 15 years old.

SELECT * from students
    WHERE year_level = 10 AND age = 15;

   student_id first_name last_name  age  year_level
0         101     Minnie     Mouse   15          10

In [21]:
%%sql
-- 2. All students who are in Year 12 OR are 18 years old.
select * from students
    WHERE year_level = 12 OR age = 18;

   student_id first_name last_name  age  year_level
0          12       Lisa   Simpson   17          12
1           1      Roger    Rabbit   18          11
2           6     Donald  Rumsfeld   18          11
3          11   Penelope   Pitstop   18          11

In [23]:
%%sql
-- 3. All students who are not in Year 9
select * from students where year_level <> 9;

    student_id first_name   last_name  age  year_level
0            1      Roger      Rabbit   18          11
1            2     Mickey       Mouse   17          10
2            4      Goofy        Goof   15           8
3            5      Daisy        Duck   14           7
4            6     Donald    Rumsfeld   18          11
5            7     George        Bush   17          10
6            9     George  Washington   15           8
7           10    Abraham     Lincoln   14           7
8           11   Penelope     Pitstop   18          11
9           12       Lisa     Simpson   17          12
10         100      Roger      Ramjet   17          11
11         101     Minnie       Mouse   15          10
12         102     Kamala      Harris   14          10

In [24]:
%%sql
-- 4. All students who are NOT in Year 9 AND NOT 13 years old

select * from students where year_level <> 9 AND age <> 13;

    student_id first_name   last_name  age  year_level
0            1      Roger      Rabbit   18          11
1            2     Mickey       Mouse   17          10
2            4      Goofy        Goof   15           8
3            5      Daisy        Duck   14           7
4            6     Donald    Rumsfeld   18          11
5            7     George        Bush   17          10
6            9     George  Washington   15           8
7           10    Abraham     Lincoln   14           7
8           11   Penelope     Pitstop   18          11
9           12       Lisa     Simpson   17          12
10         100      Roger      Ramjet   17          11
11         101     Minnie       Mouse   15          10
12         102     Kamala      Harris   14          10

In [25]:
%%sql
-- 4. All students who are NOT in Year 9 OR NOT 13 years old
select * from students where year_level <> 9 OR age <> 13;

    student_id first_name   last_name  age  year_level
0            1      Roger      Rabbit   18          11
1            2     Mickey       Mouse   17          10
2            3     Donald        Duck   16           9
3            4      Goofy        Goof   15           8
4            5      Daisy        Duck   14           7
5            6     Donald    Rumsfeld   18          11
6            7     George        Bush   17          10
7            8       Bill     Clinton   16           9
8            9     George  Washington   15           8
9           10    Abraham     Lincoln   14           7
10          11   Penelope     Pitstop   18          11
11          12       Lisa     Simpson   17          12
12         100      Roger      Ramjet   17          11
13         101     Minnie       Mouse   15          10
14         102     Kamala      Harris   14          10

In [26]:
%%sql
CHECKPOINT;

Empty DataFrame
Columns: [Success]
Index: []